:PROPERTIES:
:ID: F5B4CC6B-0602-4023-9EB1-B941FB333061
:END:
#+title: Account Roles
#+description: Account Roles
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:accounts:
#+created: 2026-05-21
#+updated: 2026-05-21

List roles assigned to an account.

#+name: account-roles
#+begin_src ores-shell :exports none
accounts roles 019c2d92-8448-7158-90d0-ccb8b5f7e812
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<account-roles>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell>
Roles for Account: 019c2d92-8448-7158-90d0-ccb8b5f7e812

+--------------------------------------+------------+------------------------------------------------------------+-------------------------------------------------------+-------------+---------+
| ID (UUID)                            | Name       | Description                                                | Permissions                                           | Recorded By | Version |
+--------------------------------------+------------+------------------------------------------------------------+-------------------------------------------------------+-------------+---------+
| 43edf938-fb1e-4d0c-b752-a94362f5f194 | SuperAdmin | Platform super administrator with tenant management access | *, iam::tenants:create, iam::tenants:delete (+5 more) | postgres    | 1       |
+--------------------------------------+------------+------------------------------------------------------------+-------------------------------------------------------+-------------+---------+


ores-shell> Bye!
#+end_example
